#!/usr/bin/env bash

# Author : chenyanpeng1992@outlook.com
# Date   : 2020-09-11

##
## 队列名   节点列表   最大运行作业数    用户最大运行作业数   优先级   描述
## ——————————————————————————————————————————————————————————————————————————
## batch    node101-160      120               60              200    双路刀片
## queue1   node51-59        20                10              100    双路机架式
## fat      node3-4          10                10              100    胖节点
## mic      node5-6          4                 4               100    协处理器
## io       node7-12         5                 5               200    IO节点
## high     all              20                10              50     高级备用队列
##

grep '^##' $0 | sed 's/##//'
